---
kind: method
id: M:Autodesk.Revit.DB.ConnectionValidationInfo.GetWarning(System.Int32)
source: html/8f6f93f2-661d-568d-3ea7-f68af8948826.htm
---
# Autodesk.Revit.DB.ConnectionValidationInfo.GetWarning Method

Access specific warning number of warnings generated by reload.

## Syntax (C#)
```csharp
public ConnectionValidationWarning GetWarning(
	int index
)
```

## Parameters
- **index** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Invalid index.
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - None of the following disciplines is enabled: Mechanical Electrical Piping.